mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xg/common/s6e1b3xg.h
typedef struct stc_hdmicec_rcdtlh_field
{
    union {
        struct {
            __IO   uint8_t  RCDTLH               :8;
        };
        struct {
            __IO   uint8_t  RCDTLH0              :1;
            __IO   uint8_t  RCDTLH1              :1;
            __IO   uint8_t  RCDTLH2              :1;
            __IO   uint8_t  RCDTLH3              :1;
            __IO   uint8_t  RCDTLH4              :1;
            __IO   uint8_t  RCDTLH5              :1;
            __IO   uint8_t  RCDTLH6              :1;
            __IO   uint8_t  RCDTLH7              :1;
        };
    };
} stc_hdmicec_rcdtlh_field_t;

typedef struct stc_hdmicec_rcckd_field
{
    union {
        struct {
            __IO  uint16_t  CKDIV                :12;
            __IO  uint16_t  CKSEL                :1;
            __IO  uint16_t  RESERVED0            :3;
        };
        struct {
            __IO  uint16_t  CKDIV0               :1;
            __IO  uint16_t  CKDIV1               :1;
            __IO  uint16_t  CKDIV2               :1;
            __IO  uint16_t  CKDIV3               :1;
            __IO  uint16_t  CKDIV4               :1;
            __IO  uint16_t  CKDIV5               :1;
            __IO  uint16_t  CKDIV6               :1;
            __IO  uint16_t  CKDIV7               :1;
            __IO  uint16_t  CKDIV8               :1;
            __IO  uint16_t  CKDIV9               :1;
            __IO  uint16_t  CKDIV10              :1;
            __IO  uint16_t  CKDIV11              :1;
            __IO  uint16_t  RESERVED1            :4;
        };
    };
} stc_hdmicec_rcckd_field_t;

typedef struct stc_hdmicec_rcrhw_field
{
    union {
        struct {
            __IO   uint8_t  RCRHW                :8;
        };
        struct {
            __IO   uint8_t  RCRHW0               :1;
            __IO   uint8_t  RCRHW1               :1;
            __IO   uint8_t  RCRHW2               :1;
            __IO   uint8_t  RCRHW3               :1;
            __IO   uint8_t  RCRHW4               :1;
            __IO   uint8_t  RCRHW5               :1;
            __IO   uint8_t  RCRHW6               :1;
            __IO   uint8_t  RCRHW7               :1;
        };
    };
} stc_hdmicec_rcrhw_field_t;

typedef struct stc_hdmicec_rcrc_field
{
        __IO   uint8_t  RC                       :1;
        __IO   uint8_t  RESERVED0                :3;
        __IO   uint8_t  RCIE                     :1;
        __IO   uint8_t  RESERVED1                :3;
} stc_hdmicec_rcrc_field_t;

typedef struct stc_hdmicec_rcle_field
{
        __IO   uint8_t  LES                      :1;
        __IO   uint8_t  LEL                      :1;
        __IO   uint8_t  RESERVED0                :1;
        __IO   uint8_t  EPE                      :1;
        __IO   uint8_t  LESE                     :1;
        __IO   uint8_t  LELE                     :1;
        __IO   uint8_t  LESIE                    :1;
        __IO   uint8_t  LELIE                    :1;
} stc_hdmicec_rcle_field_t;

typedef struct stc_hdmicec_rclesw_field
{
    union {
        struct {
            __IO   uint8_t  RCLESW               :8;
        };
        struct {
            __IO   uint8_t  RCLESW0              :1;
            __IO   uint8_t  RCLESW1              :1;
            __IO   uint8_t  RCLESW2              :1;
            __IO   uint8_t  RCLESW3              :1;
            __IO   uint8_t  RCLESW4              :1;
            __IO   uint8_t  RCLESW5              :1;
            __IO   uint8_t  RCLESW6              :1;
            __IO   uint8_t  RCLESW7              :1;
        };
    };
} stc_hdmicec_rclesw_field_t;

typedef struct stc_hdmicec_rclelw_field
{
    union {
        struct {
            __IO   uint8_t  RCLELW               :8;
        };
        struct {
            __IO   uint8_t  RCLELW0              :1;
            __IO   uint8_t  RCLELW1              :1;
            __IO   uint8_t  RCLELW2              :1;
            __IO   uint8_t  RCLELW3              :1;
            __IO   uint8_t  RCLELW4              :1;
            __IO   uint8_t  RCLELW5              :1;
            __IO   uint8_t  RCLELW6              :1;
            __IO   uint8_t  RCLELW7              :1;
        };
    };
} stc_hdmicec_rclelw_field_t;

/*******************************************************************************
* HWWDT_MODULE
*******************************************************************************/
typedef struct stc_hwwdt_wdg_ctl_field
{
        __IO  uint32_t  INTEN                    :1;
        __IO  uint32_t  RESEN                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_hwwdt_wdg_ctl_field_t;

typedef struct stc_hwwdt_wdg_ris_field
{
        __IO  uint32_t  RIS                      :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_hwwdt_wdg_ris_field_t;

/*******************************************************************************
* INTREQ_MODULE
*******************************************************************************/
typedef struct stc_intreq_irqcmode_field
{
        __IO  uint32_t  IRQCMODE                 :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irqcmode_field_t;

typedef struct stc_intreq_exc02mon_field
{
        __IO  uint32_t  NMI                      :1;
        __IO  uint32_t  HWINT                    :1;
        __IO  uint32_t  RESERVED0                :30;
} stc_intreq_exc02mon_field_t;

typedef struct stc_intreq_irq00mon_field
{
        __IO  uint32_t  FCSINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq00mon_field_t;

typedef struct stc_intreq_irq01mon_field
{
        __IO  uint32_t  SWWDTINT                 :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq01mon_field_t;

typedef struct stc_intreq_irq02mon_field
{
        __IO  uint32_t  LVDINT                   :1;
        __IO  uint32_t  RESERVED0                :31;
} stc_intreq_irq02mon_field_t;

