mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xg/common/s6e1b3xg.h
#define FM_GPIO_FPOERA                            *((volatile uint32_t*)(0x40033928UL))
#define FM0P_GPIO_FPOERA                          *((volatile uint32_t*)(0x40033928UL))
#define FM_GPIO_FPOERB                            *((volatile uint32_t*)(0x4003392CUL))
#define FM0P_GPIO_FPOERB                          *((volatile uint32_t*)(0x4003392CUL))
#define FM_GPIO_FPOERC                            *((volatile uint32_t*)(0x40033930UL))
#define FM0P_GPIO_FPOERC                          *((volatile uint32_t*)(0x40033930UL))
#define FM_GPIO_FPOERD                            *((volatile uint32_t*)(0x40033934UL))
#define FM0P_GPIO_FPOERD                          *((volatile uint32_t*)(0x40033934UL))
#define FM_GPIO_FPOERE                            *((volatile uint32_t*)(0x40033938UL))
#define FM0P_GPIO_FPOERE                          *((volatile uint32_t*)(0x40033938UL))
#define FM_GPIO_FPOERF                            *((volatile uint32_t*)(0x4003393CUL))
#define FM0P_GPIO_FPOERF                          *((volatile uint32_t*)(0x4003393CUL))

/*******************************************************************************
* HDMICEC Registers HDMICEC0
*   Register Definition
*******************************************************************************/
#define FM_HDMICEC0_TXCTRL                        *((volatile  uint8_t*)(0x40034000UL))
#define FM0P_HDMICEC0_TXCTRL                      *((volatile  uint8_t*)(0x40034000UL))
#define FM_HDMICEC0_TXDATA                        *((volatile  uint8_t*)(0x40034004UL))
#define FM0P_HDMICEC0_TXDATA                      *((volatile  uint8_t*)(0x40034004UL))
#define FM_HDMICEC0_TXSTS                         *((volatile  uint8_t*)(0x40034008UL))
#define FM0P_HDMICEC0_TXSTS                       *((volatile  uint8_t*)(0x40034008UL))
#define FM_HDMICEC0_SFREE                         *((volatile  uint8_t*)(0x4003400CUL))
#define FM0P_HDMICEC0_SFREE                       *((volatile  uint8_t*)(0x4003400CUL))
#define FM_HDMICEC0_RCST                          *((volatile  uint8_t*)(0x40034040UL))
#define FM0P_HDMICEC0_RCST                        *((volatile  uint8_t*)(0x40034040UL))
#define FM_HDMICEC0_RCCR                          *((volatile  uint8_t*)(0x40034041UL))
#define FM0P_HDMICEC0_RCCR                        *((volatile  uint8_t*)(0x40034041UL))
#define FM_HDMICEC0_RCDAHW                        *((volatile  uint8_t*)(0x40034044UL))
#define FM0P_HDMICEC0_RCDAHW                      *((volatile  uint8_t*)(0x40034044UL))
#define FM_HDMICEC0_RCSHW                         *((volatile  uint8_t*)(0x40034045UL))
#define FM0P_HDMICEC0_RCSHW                       *((volatile  uint8_t*)(0x40034045UL))
#define FM_HDMICEC0_RCDBHW                        *((volatile  uint8_t*)(0x40034049UL))
#define FM0P_HDMICEC0_RCDBHW                      *((volatile  uint8_t*)(0x40034049UL))
#define FM_HDMICEC0_RCADR2                        *((volatile  uint8_t*)(0x4003404CUL))
#define FM0P_HDMICEC0_RCADR2                      *((volatile  uint8_t*)(0x4003404CUL))
#define FM_HDMICEC0_RCADR1                        *((volatile  uint8_t*)(0x4003404DUL))
#define FM0P_HDMICEC0_RCADR1                      *((volatile  uint8_t*)(0x4003404DUL))
#define FM_HDMICEC0_RCDTHL                        *((volatile  uint8_t*)(0x40034050UL))
#define FM0P_HDMICEC0_RCDTHL                      *((volatile  uint8_t*)(0x40034050UL))
#define FM_HDMICEC0_RCDTHH                        *((volatile  uint8_t*)(0x40034051UL))
#define FM0P_HDMICEC0_RCDTHH                      *((volatile  uint8_t*)(0x40034051UL))
#define FM_HDMICEC0_RCDTLL                        *((volatile  uint8_t*)(0x40034054UL))
#define FM0P_HDMICEC0_RCDTLL                      *((volatile  uint8_t*)(0x40034054UL))
#define FM_HDMICEC0_RCDTLH                        *((volatile  uint8_t*)(0x40034055UL))
#define FM0P_HDMICEC0_RCDTLH                      *((volatile  uint8_t*)(0x40034055UL))
#define FM_HDMICEC0_RCCKD                         *((volatile uint16_t*)(0x40034058UL))
#define FM0P_HDMICEC0_RCCKD                       *((volatile uint16_t*)(0x40034058UL))
#define FM_HDMICEC0_RCRHW                         *((volatile  uint8_t*)(0x4003405CUL))
#define FM0P_HDMICEC0_RCRHW                       *((volatile  uint8_t*)(0x4003405CUL))
#define FM_HDMICEC0_RCRC                          *((volatile  uint8_t*)(0x4003405DUL))
#define FM0P_HDMICEC0_RCRC                        *((volatile  uint8_t*)(0x4003405DUL))
#define FM_HDMICEC0_RCLE                          *((volatile  uint8_t*)(0x40034061UL))
#define FM0P_HDMICEC0_RCLE                        *((volatile  uint8_t*)(0x40034061UL))
#define FM_HDMICEC0_RCLESW                        *((volatile  uint8_t*)(0x40034064UL))
#define FM0P_HDMICEC0_RCLESW                      *((volatile  uint8_t*)(0x40034064UL))
#define FM_HDMICEC0_RCLELW                        *((volatile  uint8_t*)(0x40034065UL))
#define FM0P_HDMICEC0_RCLELW                      *((volatile  uint8_t*)(0x40034065UL))

/*******************************************************************************
* HDMICEC Registers HDMICEC1
*   Register Definition
*******************************************************************************/
#define FM_HDMICEC1_TXCTRL                        *((volatile  uint8_t*)(0x40034100UL))
#define FM0P_HDMICEC1_TXCTRL                      *((volatile  uint8_t*)(0x40034100UL))
#define FM_HDMICEC1_TXDATA                        *((volatile  uint8_t*)(0x40034104UL))
#define FM0P_HDMICEC1_TXDATA                      *((volatile  uint8_t*)(0x40034104UL))
#define FM_HDMICEC1_TXSTS                         *((volatile  uint8_t*)(0x40034108UL))
#define FM0P_HDMICEC1_TXSTS                       *((volatile  uint8_t*)(0x40034108UL))
#define FM_HDMICEC1_SFREE                         *((volatile  uint8_t*)(0x4003410CUL))
#define FM0P_HDMICEC1_SFREE                       *((volatile  uint8_t*)(0x4003410CUL))
#define FM_HDMICEC1_RCST                          *((volatile  uint8_t*)(0x40034140UL))
#define FM0P_HDMICEC1_RCST                        *((volatile  uint8_t*)(0x40034140UL))
#define FM_HDMICEC1_RCCR                          *((volatile  uint8_t*)(0x40034141UL))
#define FM0P_HDMICEC1_RCCR                        *((volatile  uint8_t*)(0x40034141UL))
#define FM_HDMICEC1_RCDAHW                        *((volatile  uint8_t*)(0x40034144UL))
#define FM0P_HDMICEC1_RCDAHW                      *((volatile  uint8_t*)(0x40034144UL))
#define FM_HDMICEC1_RCSHW                         *((volatile  uint8_t*)(0x40034145UL))
#define FM0P_HDMICEC1_RCSHW                       *((volatile  uint8_t*)(0x40034145UL))
#define FM_HDMICEC1_RCDBHW                        *((volatile  uint8_t*)(0x40034149UL))
#define FM0P_HDMICEC1_RCDBHW                      *((volatile  uint8_t*)(0x40034149UL))
#define FM_HDMICEC1_RCADR2                        *((volatile  uint8_t*)(0x4003414CUL))
#define FM0P_HDMICEC1_RCADR2                      *((volatile  uint8_t*)(0x4003414CUL))
#define FM_HDMICEC1_RCADR1                        *((volatile  uint8_t*)(0x4003414DUL))
#define FM0P_HDMICEC1_RCADR1                      *((volatile  uint8_t*)(0x4003414DUL))
#define FM_HDMICEC1_RCDTHL                        *((volatile  uint8_t*)(0x40034150UL))
#define FM0P_HDMICEC1_RCDTHL                      *((volatile  uint8_t*)(0x40034150UL))
#define FM_HDMICEC1_RCDTHH                        *((volatile  uint8_t*)(0x40034151UL))
#define FM0P_HDMICEC1_RCDTHH                      *((volatile  uint8_t*)(0x40034151UL))
#define FM_HDMICEC1_RCDTLL                        *((volatile  uint8_t*)(0x40034154UL))
#define FM0P_HDMICEC1_RCDTLL                      *((volatile  uint8_t*)(0x40034154UL))
#define FM_HDMICEC1_RCDTLH                        *((volatile  uint8_t*)(0x40034155UL))
#define FM0P_HDMICEC1_RCDTLH                      *((volatile  uint8_t*)(0x40034155UL))
#define FM_HDMICEC1_RCCKD                         *((volatile uint16_t*)(0x40034158UL))
#define FM0P_HDMICEC1_RCCKD                       *((volatile uint16_t*)(0x40034158UL))
#define FM_HDMICEC1_RCRHW                         *((volatile  uint8_t*)(0x4003415CUL))
#define FM0P_HDMICEC1_RCRHW                       *((volatile  uint8_t*)(0x4003415CUL))
#define FM_HDMICEC1_RCRC                          *((volatile  uint8_t*)(0x4003415DUL))
#define FM0P_HDMICEC1_RCRC                        *((volatile  uint8_t*)(0x4003415DUL))
#define FM_HDMICEC1_RCLE                          *((volatile  uint8_t*)(0x40034161UL))
#define FM0P_HDMICEC1_RCLE                        *((volatile  uint8_t*)(0x40034161UL))
#define FM_HDMICEC1_RCLESW                        *((volatile  uint8_t*)(0x40034164UL))
#define FM0P_HDMICEC1_RCLESW                      *((volatile  uint8_t*)(0x40034164UL))
#define FM_HDMICEC1_RCLELW                        *((volatile  uint8_t*)(0x40034165UL))
#define FM0P_HDMICEC1_RCLELW                      *((volatile  uint8_t*)(0x40034165UL))

