mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xg/common/s6e1b3xg.h
#define FM_INTREQ_IRQ04MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ05MON_AVAILABLE            1
#define FM_INTREQ_IRQ05MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ06MON_AVAILABLE            1
#define FM_INTREQ_IRQ06MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ07MON_AVAILABLE            1
#define FM_INTREQ_IRQ07MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ08MON_AVAILABLE            1
#define FM_INTREQ_IRQ08MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ09MON_AVAILABLE            1
#define FM_INTREQ_IRQ09MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ10MON_AVAILABLE            1
#define FM_INTREQ_IRQ10MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ11MON_AVAILABLE            1
#define FM_INTREQ_IRQ11MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ12MON_AVAILABLE            1
#define FM_INTREQ_IRQ12MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ13MON_AVAILABLE            1
#define FM_INTREQ_IRQ13MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ14MON_AVAILABLE            1
#define FM_INTREQ_IRQ14MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ15MON_AVAILABLE            1
#define FM_INTREQ_IRQ15MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ16MON_AVAILABLE            1
#define FM_INTREQ_IRQ16MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ17MON_AVAILABLE            1
#define FM_INTREQ_IRQ17MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ18MON_AVAILABLE            1
#define FM_INTREQ_IRQ18MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ19MON_AVAILABLE            1
#define FM_INTREQ_IRQ19MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ20MON_AVAILABLE            1
#define FM_INTREQ_IRQ20MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ21MON_AVAILABLE            1
#define FM_INTREQ_IRQ21MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ22MON_AVAILABLE            1
#define FM_INTREQ_IRQ22MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ23MON_AVAILABLE            1
#define FM_INTREQ_IRQ23MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ24MON_AVAILABLE            1
#define FM_INTREQ_IRQ24MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ25MON_AVAILABLE            1
#define FM_INTREQ_IRQ25MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ26MON_AVAILABLE            1
#define FM_INTREQ_IRQ26MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ27MON_AVAILABLE            1
#define FM_INTREQ_IRQ27MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ28MON_AVAILABLE            1
#define FM_INTREQ_IRQ28MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ29MON_AVAILABLE            1
#define FM_INTREQ_IRQ29MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ30MON_AVAILABLE            1
#define FM_INTREQ_IRQ30MON_AVAILABLE              1
#define FM0P_INTREQ_IRQ31MON_AVAILABLE            1
#define FM_INTREQ_IRQ31MON_AVAILABLE              1
#define FM0P_INTREQ_IRQCMODE_AVAILABLE            1
#define FM_INTREQ_IRQCMODE_AVAILABLE              1
#define FM0P_INTREQ_RCINTSEL0_AVAILABLE           1
#define FM_INTREQ_RCINTSEL0_AVAILABLE             1
#define FM0P_INTREQ_RCINTSEL1_AVAILABLE           1
#define FM_INTREQ_RCINTSEL1_AVAILABLE             1
/*******************************************************************************
* LSCRP
*******************************************************************************/
#define FM0P_LSCRP_LCR_PRSLD_AVAILABLE            1
#define FM_LSCRP_LCR_PRSLD_AVAILABLE              1
/*******************************************************************************
* LVD
*******************************************************************************/
#define FM0P_LVD_LVD_CLR_AVAILABLE                1
#define FM_LVD_LVD_CLR_AVAILABLE                  1
#define FM0P_LVD_LVD_CTL_AVAILABLE                1
#define FM_LVD_LVD_CTL_AVAILABLE                  1
#define FM0P_LVD_LVD_CTL2_AVAILABLE               1
#define FM_LVD_LVD_CTL2_AVAILABLE                 1
#define FM0P_LVD_LVD_RLR_AVAILABLE                1
#define FM_LVD_LVD_RLR_AVAILABLE                  1
#define FM0P_LVD_LVD_STR_AVAILABLE                1
#define FM_LVD_LVD_STR_AVAILABLE                  1
#define FM0P_LVD_LVD_STR2_AVAILABLE               1
#define FM_LVD_LVD_STR2_AVAILABLE                 1
#define FM0P_LVD_LVD2_CTL_AVAILABLE               1
#define FM_LVD_LVD2_CTL_AVAILABLE                 1
#define FM0P_LVD_LVD2_CTL2_AVAILABLE              1
#define FM_LVD_LVD2_CTL2_AVAILABLE                1
/*******************************************************************************
* MFS0
*******************************************************************************/
#define FM0P_MFS_CSIO_BGR_AVAILABLE               1
#define FM_MFS_CSIO_BGR_AVAILABLE                 1
#define FM0P_MFS_CSIO_ESCR_AVAILABLE              1
#define FM_MFS_CSIO_ESCR_AVAILABLE                1
#define FM0P_MFS_CSIO_FBYTE1_AVAILABLE            1
#define FM_MFS_CSIO_FBYTE1_AVAILABLE              1
#define FM0P_MFS_CSIO_FBYTE2_AVAILABLE            1
#define FM_MFS_CSIO_FBYTE2_AVAILABLE              1
#define FM0P_MFS_CSIO_FCR_AVAILABLE               1
#define FM_MFS_CSIO_FCR_AVAILABLE                 1
#define FM0P_MFS_CSIO_RDR_AVAILABLE               1
#define FM_MFS_CSIO_RDR_AVAILABLE                 1
#define FM0P_MFS_CSIO_SACSR_AVAILABLE             1
#define FM_MFS_CSIO_SACSR_AVAILABLE               1
#define FM0P_MFS_CSIO_SCR_AVAILABLE               1
#define FM_MFS_CSIO_SCR_AVAILABLE                 1
#define FM0P_MFS_CSIO_SCSCR_AVAILABLE             1
#define FM_MFS_CSIO_SCSCR_AVAILABLE               1
#define FM0P_MFS_CSIO_SCSFR0_AVAILABLE            1
#define FM_MFS_CSIO_SCSFR0_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSFR1_AVAILABLE            1
#define FM_MFS_CSIO_SCSFR1_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSFR2_AVAILABLE            1
#define FM_MFS_CSIO_SCSFR2_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSTR0_AVAILABLE            1
#define FM_MFS_CSIO_SCSTR0_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSTR1_AVAILABLE            1
#define FM_MFS_CSIO_SCSTR1_AVAILABLE              1
#define FM0P_MFS_CSIO_SCSTR32_AVAILABLE           1
#define FM_MFS_CSIO_SCSTR32_AVAILABLE             1
#define FM0P_MFS_CSIO_SMR_AVAILABLE               1
#define FM_MFS_CSIO_SMR_AVAILABLE                 1
#define FM0P_MFS_CSIO_SSR_AVAILABLE               1
#define FM_MFS_CSIO_SSR_AVAILABLE                 1
#define FM0P_MFS_CSIO_STMCR_AVAILABLE             1
#define FM_MFS_CSIO_STMCR_AVAILABLE               1
#define FM0P_MFS_CSIO_STMR_AVAILABLE              1
#define FM_MFS_CSIO_STMR_AVAILABLE                1
#define FM0P_MFS_CSIO_TBYTE0_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE0_AVAILABLE              1
#define FM0P_MFS_CSIO_TBYTE1_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE1_AVAILABLE              1
#define FM0P_MFS_CSIO_TBYTE2_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE2_AVAILABLE              1
#define FM0P_MFS_CSIO_TBYTE3_AVAILABLE            1
#define FM_MFS_CSIO_TBYTE3_AVAILABLE              1
#define FM0P_MFS_CSIO_TDR_AVAILABLE               1
#define FM_MFS_CSIO_TDR_AVAILABLE                 1
#define FM0P_MFS_I2C_BGR_AVAILABLE                1
#define FM_MFS_I2C_BGR_AVAILABLE                  1
#define FM0P_MFS_I2C_EIBCR_AVAILABLE              1
#define FM_MFS_I2C_EIBCR_AVAILABLE                1
#define FM0P_MFS_I2C_FBYTE1_AVAILABLE             1
#define FM_MFS_I2C_FBYTE1_AVAILABLE               1
#define FM0P_MFS_I2C_FBYTE2_AVAILABLE             1
#define FM_MFS_I2C_FBYTE2_AVAILABLE               1
#define FM0P_MFS_I2C_FCR_AVAILABLE                1
#define FM_MFS_I2C_FCR_AVAILABLE                  1
#define FM0P_MFS_I2C_IBCR_AVAILABLE               1
#define FM_MFS_I2C_IBCR_AVAILABLE                 1
#define FM0P_MFS_I2C_IBSR_AVAILABLE               1
#define FM_MFS_I2C_IBSR_AVAILABLE                 1
#define FM0P_MFS_I2C_ISBA_AVAILABLE               1
#define FM_MFS_I2C_ISBA_AVAILABLE                 1
#define FM0P_MFS_I2C_ISMK_AVAILABLE               1
#define FM_MFS_I2C_ISMK_AVAILABLE                 1
#define FM0P_MFS_I2C_RDR_AVAILABLE                1
#define FM_MFS_I2C_RDR_AVAILABLE                  1
#define FM0P_MFS_I2C_SMR_AVAILABLE                1
#define FM_MFS_I2C_SMR_AVAILABLE                  1
#define FM0P_MFS_I2C_SSR_AVAILABLE                1
#define FM_MFS_I2C_SSR_AVAILABLE                  1
#define FM0P_MFS_I2C_TDR_AVAILABLE                1
#define FM_MFS_I2C_TDR_AVAILABLE                  1
#define FM0P_MFS_I2S_ESCR_AVAILABLE               1
#define FM_MFS_I2S_ESCR_AVAILABLE                 1
#define FM0P_MFS_I2S_FBYTE1_AVAILABLE             1
#define FM_MFS_I2S_FBYTE1_AVAILABLE               1
#define FM0P_MFS_I2S_FBYTE2_AVAILABLE             1
#define FM_MFS_I2S_FBYTE2_AVAILABLE               1
#define FM0P_MFS_I2S_FCR_AVAILABLE                1
#define FM_MFS_I2S_FCR_AVAILABLE                  1
#define FM0P_MFS_I2S_RDR_AVAILABLE                1
#define FM_MFS_I2S_RDR_AVAILABLE                  1
#define FM0P_MFS_I2S_SCR_AVAILABLE                1
#define FM_MFS_I2S_SCR_AVAILABLE                  1
#define FM0P_MFS_I2S_SMR_AVAILABLE                1
#define FM_MFS_I2S_SMR_AVAILABLE                  1
#define FM0P_MFS_I2S_SSR_AVAILABLE                1
#define FM_MFS_I2S_SSR_AVAILABLE                  1
#define FM0P_MFS_I2S_TDR_AVAILABLE                1
#define FM_MFS_I2S_TDR_AVAILABLE                  1
#define FM0P_MFS_LIN_BGR_AVAILABLE                1
#define FM_MFS_LIN_BGR_AVAILABLE                  1
#define FM0P_MFS_LIN_ESCR_AVAILABLE               1
#define FM_MFS_LIN_ESCR_AVAILABLE                 1
#define FM0P_MFS_LIN_FBYTE1_AVAILABLE             1
#define FM_MFS_LIN_FBYTE1_AVAILABLE               1
#define FM0P_MFS_LIN_FBYTE2_AVAILABLE             1
#define FM_MFS_LIN_FBYTE2_AVAILABLE               1
#define FM0P_MFS_LIN_FCR_AVAILABLE                1
#define FM_MFS_LIN_FCR_AVAILABLE                  1
#define FM0P_MFS_LIN_RDR_AVAILABLE                1
#define FM_MFS_LIN_RDR_AVAILABLE                  1
#define FM0P_MFS_LIN_SCR_AVAILABLE                1
#define FM_MFS_LIN_SCR_AVAILABLE                  1
#define FM0P_MFS_LIN_SMR_AVAILABLE                1
#define FM_MFS_LIN_SMR_AVAILABLE                  1
#define FM0P_MFS_LIN_SSR_AVAILABLE                1
#define FM_MFS_LIN_SSR_AVAILABLE                  1
#define FM0P_MFS_LIN_TDR_AVAILABLE                1
#define FM_MFS_LIN_TDR_AVAILABLE                  1
#define FM0P_MFS_UART_BGR_AVAILABLE               1
#define FM_MFS_UART_BGR_AVAILABLE                 1
#define FM0P_MFS_UART_ESCR_AVAILABLE              1
#define FM_MFS_UART_ESCR_AVAILABLE                1
#define FM0P_MFS_UART_FBYTE1_AVAILABLE            1
#define FM_MFS_UART_FBYTE1_AVAILABLE              1
#define FM0P_MFS_UART_FBYTE2_AVAILABLE            1
#define FM_MFS_UART_FBYTE2_AVAILABLE              1
#define FM0P_MFS_UART_FCR_AVAILABLE               1
#define FM_MFS_UART_FCR_AVAILABLE                 1
#define FM0P_MFS_UART_RDR_AVAILABLE               1
#define FM_MFS_UART_RDR_AVAILABLE                 1
#define FM0P_MFS_UART_SCR_AVAILABLE               1
#define FM_MFS_UART_SCR_AVAILABLE                 1
#define FM0P_MFS_UART_SMR_AVAILABLE               1
#define FM_MFS_UART_SMR_AVAILABLE                 1
#define FM0P_MFS_UART_SSR_AVAILABLE               1
#define FM_MFS_UART_SSR_AVAILABLE                 1
#define FM0P_MFS_UART_TDR_AVAILABLE               1
#define FM_MFS_UART_TDR_AVAILABLE                 1
/*******************************************************************************
* MFSI2S0
*******************************************************************************/
#define FM0P_MFSI2S_CNTLREG_AVAILABLE             1
#define FM_MFSI2S_CNTLREG_AVAILABLE               1
#define FM0P_MFSI2S_I2SCLK_AVAILABLE              1
#define FM_MFSI2S_I2SCLK_AVAILABLE                1
#define FM0P_MFSI2S_I2SRST_AVAILABLE              1
#define FM_MFSI2S_I2SRST_AVAILABLE                1
#define FM0P_MFSI2S_I2SST_AVAILABLE               1
#define FM_MFSI2S_I2SST_AVAILABLE                 1
/*******************************************************************************
* MFT0
*******************************************************************************/
#define FM0P_MFT_ADCMP_ACFS10_AVAILABLE           1
#define FM_MFT_ADCMP_ACFS10_AVAILABLE             1
#define FM0P_MFT_ADCMP_ACFS32_AVAILABLE           1
#define FM_MFT_ADCMP_ACFS32_AVAILABLE             1
#define FM0P_MFT_ADCMP_ACFS54_AVAILABLE           1
#define FM_MFT_ADCMP_ACFS54_AVAILABLE             1
#define FM0P_MFT_ADCMP_ACMP0_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP0_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP1_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP1_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP2_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP2_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP3_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP3_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP4_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP4_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACMP5_AVAILABLE            1
#define FM_MFT_ADCMP_ACMP5_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSA_AVAILABLE             1
#define FM_MFT_ADCMP_ACSA_AVAILABLE               1
#define FM0P_MFT_ADCMP_ACSC0_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC0_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC1_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC1_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC2_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC2_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC3_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC3_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC4_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC4_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSC5_AVAILABLE            1
#define FM_MFT_ADCMP_ACSC5_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD0_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD0_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD1_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD1_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD2_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD2_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD3_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD3_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD4_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD4_AVAILABLE              1
#define FM0P_MFT_ADCMP_ACSD5_AVAILABLE            1
#define FM_MFT_ADCMP_ACSD5_AVAILABLE              1
#define FM0P_MFT_FRT_TCAL_AVAILABLE               1
#define FM_MFT_FRT_TCAL_AVAILABLE                 1
#define FM0P_MFT_FRT_TCCP0_AVAILABLE              1
#define FM_MFT_FRT_TCCP0_AVAILABLE                1
#define FM0P_MFT_FRT_TCCP1_AVAILABLE              1
#define FM_MFT_FRT_TCCP1_AVAILABLE                1
#define FM0P_MFT_FRT_TCCP2_AVAILABLE              1
#define FM_MFT_FRT_TCCP2_AVAILABLE                1
#define FM0P_MFT_FRT_TCDT0_AVAILABLE              1
#define FM_MFT_FRT_TCDT0_AVAILABLE                1
#define FM0P_MFT_FRT_TCDT1_AVAILABLE              1
#define FM_MFT_FRT_TCDT1_AVAILABLE                1
#define FM0P_MFT_FRT_TCDT2_AVAILABLE              1
#define FM_MFT_FRT_TCDT2_AVAILABLE                1
#define FM0P_MFT_FRT_TCSA0_AVAILABLE              1
#define FM_MFT_FRT_TCSA0_AVAILABLE                1
#define FM0P_MFT_FRT_TCSA1_AVAILABLE              1
#define FM_MFT_FRT_TCSA1_AVAILABLE                1
#define FM0P_MFT_FRT_TCSA2_AVAILABLE              1
#define FM_MFT_FRT_TCSA2_AVAILABLE                1
#define FM0P_MFT_FRT_TCSC0_AVAILABLE              1
#define FM_MFT_FRT_TCSC0_AVAILABLE                1
#define FM0P_MFT_FRT_TCSC1_AVAILABLE              1
#define FM_MFT_FRT_TCSC1_AVAILABLE                1
#define FM0P_MFT_FRT_TCSC2_AVAILABLE              1
#define FM_MFT_FRT_TCSC2_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP0_AVAILABLE              1
#define FM_MFT_ICU_ICCP0_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP1_AVAILABLE              1
#define FM_MFT_ICU_ICCP1_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP2_AVAILABLE              1
#define FM_MFT_ICU_ICCP2_AVAILABLE                1
#define FM0P_MFT_ICU_ICCP3_AVAILABLE              1
#define FM_MFT_ICU_ICCP3_AVAILABLE                1
#define FM0P_MFT_ICU_ICFS10_AVAILABLE             1
#define FM_MFT_ICU_ICFS10_AVAILABLE               1
#define FM0P_MFT_ICU_ICFS32_AVAILABLE             1
#define FM_MFT_ICU_ICFS32_AVAILABLE               1
#define FM0P_MFT_ICU_ICSA10_AVAILABLE             1
#define FM_MFT_ICU_ICSA10_AVAILABLE               1
#define FM0P_MFT_ICU_ICSA32_AVAILABLE             1
#define FM_MFT_ICU_ICSA32_AVAILABLE               1
#define FM0P_MFT_ICU_ICSB10_AVAILABLE             1
#define FM_MFT_ICU_ICSB10_AVAILABLE               1
#define FM0P_MFT_ICU_ICSB32_AVAILABLE             1
#define FM_MFT_ICU_ICSB32_AVAILABLE               1
#define FM0P_MFT_OCU_OCCP0_AVAILABLE              1
#define FM_MFT_OCU_OCCP0_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP1_AVAILABLE              1
#define FM_MFT_OCU_OCCP1_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP2_AVAILABLE              1
#define FM_MFT_OCU_OCCP2_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP3_AVAILABLE              1
#define FM_MFT_OCU_OCCP3_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP4_AVAILABLE              1
#define FM_MFT_OCU_OCCP4_AVAILABLE                1
#define FM0P_MFT_OCU_OCCP5_AVAILABLE              1
#define FM_MFT_OCU_OCCP5_AVAILABLE                1
#define FM0P_MFT_OCU_OCFS10_AVAILABLE             1
#define FM_MFT_OCU_OCFS10_AVAILABLE               1
#define FM0P_MFT_OCU_OCFS32_AVAILABLE             1
#define FM_MFT_OCU_OCFS32_AVAILABLE               1
#define FM0P_MFT_OCU_OCFS54_AVAILABLE             1
#define FM_MFT_OCU_OCFS54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSA10_AVAILABLE             1
#define FM_MFT_OCU_OCSA10_AVAILABLE               1
#define FM0P_MFT_OCU_OCSA32_AVAILABLE             1
#define FM_MFT_OCU_OCSA32_AVAILABLE               1
#define FM0P_MFT_OCU_OCSA54_AVAILABLE             1
#define FM_MFT_OCU_OCSA54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSB10_AVAILABLE             1
#define FM_MFT_OCU_OCSB10_AVAILABLE               1
#define FM0P_MFT_OCU_OCSB32_AVAILABLE             1
#define FM_MFT_OCU_OCSB32_AVAILABLE               1
#define FM0P_MFT_OCU_OCSB54_AVAILABLE             1
#define FM_MFT_OCU_OCSB54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSC_AVAILABLE               1
#define FM_MFT_OCU_OCSC_AVAILABLE                 1
#define FM0P_MFT_OCU_OCSD10_AVAILABLE             1
#define FM_MFT_OCU_OCSD10_AVAILABLE               1
#define FM0P_MFT_OCU_OCSD32_AVAILABLE             1
#define FM_MFT_OCU_OCSD32_AVAILABLE               1
#define FM0P_MFT_OCU_OCSD54_AVAILABLE             1
#define FM_MFT_OCU_OCSD54_AVAILABLE               1
#define FM0P_MFT_OCU_OCSE0_AVAILABLE              1
#define FM_MFT_OCU_OCSE0_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE1_AVAILABLE              1
#define FM_MFT_OCU_OCSE1_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE2_AVAILABLE              1
#define FM_MFT_OCU_OCSE2_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE3_AVAILABLE              1
#define FM_MFT_OCU_OCSE3_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE4_AVAILABLE              1
#define FM_MFT_OCU_OCSE4_AVAILABLE                1
#define FM0P_MFT_OCU_OCSE5_AVAILABLE              1
#define FM_MFT_OCU_OCSE5_AVAILABLE                1
#define FM0P_MFT_WFG_NZCL_AVAILABLE               1
#define FM_MFT_WFG_NZCL_AVAILABLE                 1
#define FM0P_MFT_WFG_WFIR_AVAILABLE               1
#define FM_MFT_WFG_WFIR_AVAILABLE                 1
#define FM0P_MFT_WFG_WFSA10_AVAILABLE             1
#define FM_MFT_WFG_WFSA10_AVAILABLE               1
#define FM0P_MFT_WFG_WFSA32_AVAILABLE             1
#define FM_MFT_WFG_WFSA32_AVAILABLE               1
#define FM0P_MFT_WFG_WFSA54_AVAILABLE             1
#define FM_MFT_WFG_WFSA54_AVAILABLE               1
#define FM0P_MFT_WFG_WFTA10_AVAILABLE             1
#define FM_MFT_WFG_WFTA10_AVAILABLE               1
#define FM0P_MFT_WFG_WFTA32_AVAILABLE             1
#define FM_MFT_WFG_WFTA32_AVAILABLE               1
#define FM0P_MFT_WFG_WFTA54_AVAILABLE             1
#define FM_MFT_WFG_WFTA54_AVAILABLE               1
#define FM0P_MFT_WFG_WFTB10_AVAILABLE             1
#define FM_MFT_WFG_WFTB10_AVAILABLE               1
#define FM0P_MFT_WFG_WFTB32_AVAILABLE             1
#define FM_MFT_WFG_WFTB32_AVAILABLE               1
#define FM0P_MFT_WFG_WFTB54_AVAILABLE             1
#define FM_MFT_WFG_WFTB54_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF10_AVAILABLE             1
#define FM_MFT_WFG_WFTF10_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF32_AVAILABLE             1
#define FM_MFT_WFG_WFTF32_AVAILABLE               1
#define FM0P_MFT_WFG_WFTF54_AVAILABLE             1
#define FM_MFT_WFG_WFTF54_AVAILABLE               1
/*******************************************************************************
* MFT_PPG
*******************************************************************************/
#define FM0P_MFT_PPG_COMP0_AVAILABLE              1
#define FM_MFT_PPG_COMP0_AVAILABLE                1
#define FM0P_MFT_PPG_COMP1_AVAILABLE              1
#define FM_MFT_PPG_COMP1_AVAILABLE                1
#define FM0P_MFT_PPG_COMP10_AVAILABLE             1
#define FM_MFT_PPG_COMP10_AVAILABLE               1
#define FM0P_MFT_PPG_COMP12_AVAILABLE             1
#define FM_MFT_PPG_COMP12_AVAILABLE               1
#define FM0P_MFT_PPG_COMP14_AVAILABLE             1
#define FM_MFT_PPG_COMP14_AVAILABLE               1
#define FM0P_MFT_PPG_COMP2_AVAILABLE              1
#define FM_MFT_PPG_COMP2_AVAILABLE                1
#define FM0P_MFT_PPG_COMP3_AVAILABLE              1
#define FM_MFT_PPG_COMP3_AVAILABLE                1
#define FM0P_MFT_PPG_COMP4_AVAILABLE              1
#define FM_MFT_PPG_COMP4_AVAILABLE                1
#define FM0P_MFT_PPG_COMP5_AVAILABLE              1
#define FM_MFT_PPG_COMP5_AVAILABLE                1
#define FM0P_MFT_PPG_COMP6_AVAILABLE              1
#define FM_MFT_PPG_COMP6_AVAILABLE                1
#define FM0P_MFT_PPG_COMP7_AVAILABLE              1
#define FM_MFT_PPG_COMP7_AVAILABLE                1
#define FM0P_MFT_PPG_COMP8_AVAILABLE              1
#define FM_MFT_PPG_COMP8_AVAILABLE                1
#define FM0P_MFT_PPG_GATEC0_AVAILABLE             1
#define FM_MFT_PPG_GATEC0_AVAILABLE               1
#define FM0P_MFT_PPG_GATEC12_AVAILABLE            1
#define FM_MFT_PPG_GATEC12_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC16_AVAILABLE            1
#define FM_MFT_PPG_GATEC16_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC20_AVAILABLE            1
#define FM_MFT_PPG_GATEC20_AVAILABLE              1
#define FM0P_MFT_PPG_GATEC4_AVAILABLE             1
#define FM_MFT_PPG_GATEC4_AVAILABLE               1
#define FM0P_MFT_PPG_GATEC8_AVAILABLE             1
#define FM_MFT_PPG_GATEC8_AVAILABLE               1
#define FM0P_MFT_PPG_IGBTC_AVAILABLE              1
#define FM_MFT_PPG_IGBTC_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC0_AVAILABLE              1
#define FM_MFT_PPG_PPGC0_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC1_AVAILABLE              1
#define FM_MFT_PPG_PPGC1_AVAILABLE                1
#define FM0P_MFT_PPG_PPGC10_AVAILABLE             1
#define FM_MFT_PPG_PPGC10_AVAILABLE               1
#define FM0P_MFT_PPG_PPGC11_AVAILABLE             1
#define FM_MFT_PPG_PPGC11_AVAILABLE               1
