mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xg/common/s6e1b3xg.h
#define bFM_FASTIO_FPDOR5_P0                      *((volatile  uint8_t *)(0xF8015404UL))
#define bFM0P_FASTIO_FPDOR5_P0                    *((volatile  uint8_t *)(0xF8015404UL))
#define bFM_FASTIO_FPDOR5_P1                      *((volatile  uint8_t *)(0xF8015408UL))
#define bFM0P_FASTIO_FPDOR5_P1                    *((volatile  uint8_t *)(0xF8015408UL))
#define bFM_FASTIO_FPDOR5_P2                      *((volatile  uint8_t *)(0xF8015410UL))
#define bFM0P_FASTIO_FPDOR5_P2                    *((volatile  uint8_t *)(0xF8015410UL))
#define bFM_FASTIO_FPDOR5_P3                      *((volatile  uint8_t *)(0xF8015420UL))
#define bFM0P_FASTIO_FPDOR5_P3                    *((volatile  uint8_t *)(0xF8015420UL))
#define bFM_FASTIO_FPDOR5_P4                      *((volatile  uint8_t *)(0xF8015440UL))
#define bFM0P_FASTIO_FPDOR5_P4                    *((volatile  uint8_t *)(0xF8015440UL))
#define bFM_FASTIO_FPDOR5_P5                      *((volatile  uint8_t *)(0xF8015480UL))
#define bFM0P_FASTIO_FPDOR5_P5                    *((volatile  uint8_t *)(0xF8015480UL))
#define bFM_FASTIO_FPDOR5_P6                      *((volatile  uint8_t *)(0xF8015500UL))
#define bFM0P_FASTIO_FPDOR5_P6                    *((volatile  uint8_t *)(0xF8015500UL))
#define bFM_FASTIO_FPDOR5_P7                      *((volatile  uint8_t *)(0xF8015600UL))
#define bFM0P_FASTIO_FPDOR5_P7                    *((volatile  uint8_t *)(0xF8015600UL))
#define bFM_FASTIO_FPDOR5_P8                      *((volatile  uint8_t *)(0xF8015405UL))
#define bFM0P_FASTIO_FPDOR5_P8                    *((volatile  uint8_t *)(0xF8015405UL))
#define bFM_FASTIO_FPDOR5_P9                      *((volatile  uint8_t *)(0xF8015409UL))
#define bFM0P_FASTIO_FPDOR5_P9                    *((volatile  uint8_t *)(0xF8015409UL))
#define bFM_FASTIO_FPDOR5_PA                      *((volatile  uint8_t *)(0xF8015411UL))
#define bFM0P_FASTIO_FPDOR5_PA                    *((volatile  uint8_t *)(0xF8015411UL))
#define bFM_FASTIO_FPDOR5_PB                      *((volatile  uint8_t *)(0xF8015421UL))
#define bFM0P_FASTIO_FPDOR5_PB                    *((volatile  uint8_t *)(0xF8015421UL))

#define bFM_FASTIO_FPDOR6_P0                      *((volatile  uint8_t *)(0xF8015804UL))
#define bFM0P_FASTIO_FPDOR6_P0                    *((volatile  uint8_t *)(0xF8015804UL))
#define bFM_FASTIO_FPDOR6_P1                      *((volatile  uint8_t *)(0xF8015808UL))
#define bFM0P_FASTIO_FPDOR6_P1                    *((volatile  uint8_t *)(0xF8015808UL))
#define bFM_FASTIO_FPDOR6_P2                      *((volatile  uint8_t *)(0xF8015810UL))
#define bFM0P_FASTIO_FPDOR6_P2                    *((volatile  uint8_t *)(0xF8015810UL))
#define bFM_FASTIO_FPDOR6_P3                      *((volatile  uint8_t *)(0xF8015820UL))
#define bFM0P_FASTIO_FPDOR6_P3                    *((volatile  uint8_t *)(0xF8015820UL))
#define bFM_FASTIO_FPDOR6_P4                      *((volatile  uint8_t *)(0xF8015840UL))
#define bFM0P_FASTIO_FPDOR6_P4                    *((volatile  uint8_t *)(0xF8015840UL))
#define bFM_FASTIO_FPDOR6_P5                      *((volatile  uint8_t *)(0xF8015880UL))
#define bFM0P_FASTIO_FPDOR6_P5                    *((volatile  uint8_t *)(0xF8015880UL))
#define bFM_FASTIO_FPDOR6_P6                      *((volatile  uint8_t *)(0xF8015900UL))
#define bFM0P_FASTIO_FPDOR6_P6                    *((volatile  uint8_t *)(0xF8015900UL))
#define bFM_FASTIO_FPDOR6_P7                      *((volatile  uint8_t *)(0xF8015A00UL))
#define bFM0P_FASTIO_FPDOR6_P7                    *((volatile  uint8_t *)(0xF8015A00UL))
#define bFM_FASTIO_FPDOR6_P8                      *((volatile  uint8_t *)(0xF8015805UL))
#define bFM0P_FASTIO_FPDOR6_P8                    *((volatile  uint8_t *)(0xF8015805UL))

#define bFM_FASTIO_FPDOR7_P0                      *((volatile  uint8_t *)(0xF8015C04UL))
#define bFM0P_FASTIO_FPDOR7_P0                    *((volatile  uint8_t *)(0xF8015C04UL))
#define bFM_FASTIO_FPDOR7_P1                      *((volatile  uint8_t *)(0xF8015C08UL))
#define bFM0P_FASTIO_FPDOR7_P1                    *((volatile  uint8_t *)(0xF8015C08UL))
#define bFM_FASTIO_FPDOR7_P2                      *((volatile  uint8_t *)(0xF8015C10UL))
#define bFM0P_FASTIO_FPDOR7_P2                    *((volatile  uint8_t *)(0xF8015C10UL))
#define bFM_FASTIO_FPDOR7_P3                      *((volatile  uint8_t *)(0xF8015C20UL))
#define bFM0P_FASTIO_FPDOR7_P3                    *((volatile  uint8_t *)(0xF8015C20UL))
#define bFM_FASTIO_FPDOR7_P4                      *((volatile  uint8_t *)(0xF8015C40UL))
#define bFM0P_FASTIO_FPDOR7_P4                    *((volatile  uint8_t *)(0xF8015C40UL))

#define bFM_FASTIO_FPDOR8_P0                      *((volatile  uint8_t *)(0xF8016004UL))
#define bFM0P_FASTIO_FPDOR8_P0                    *((volatile  uint8_t *)(0xF8016004UL))
#define bFM_FASTIO_FPDOR8_P1                      *((volatile  uint8_t *)(0xF8016008UL))
#define bFM0P_FASTIO_FPDOR8_P1                    *((volatile  uint8_t *)(0xF8016008UL))
#define bFM_FASTIO_FPDOR8_P2                      *((volatile  uint8_t *)(0xF8016010UL))
#define bFM0P_FASTIO_FPDOR8_P2                    *((volatile  uint8_t *)(0xF8016010UL))

#define bFM_FASTIO_FPDORE_P0                      *((volatile  uint8_t *)(0xF8017804UL))
#define bFM0P_FASTIO_FPDORE_P0                    *((volatile  uint8_t *)(0xF8017804UL))
#define bFM_FASTIO_FPDORE_P2                      *((volatile  uint8_t *)(0xF8017810UL))
#define bFM0P_FASTIO_FPDORE_P2                    *((volatile  uint8_t *)(0xF8017810UL))
#define bFM_FASTIO_FPDORE_P3                      *((volatile  uint8_t *)(0xF8017820UL))
#define bFM0P_FASTIO_FPDORE_P3                    *((volatile  uint8_t *)(0xF8017820UL))

#define bFM_FASTIO_M_FPDIR0_P0                    *((volatile  uint8_t *)(0xF8018004UL))
#define bFM0P_FASTIO_M_FPDIR0_P0                  *((volatile  uint8_t *)(0xF8018004UL))
#define bFM_FASTIO_M_FPDIR0_P1                    *((volatile  uint8_t *)(0xF8018008UL))
#define bFM0P_FASTIO_M_FPDIR0_P1                  *((volatile  uint8_t *)(0xF8018008UL))
#define bFM_FASTIO_M_FPDIR0_P2                    *((volatile  uint8_t *)(0xF8018010UL))
#define bFM0P_FASTIO_M_FPDIR0_P2                  *((volatile  uint8_t *)(0xF8018010UL))
#define bFM_FASTIO_M_FPDIR0_P3                    *((volatile  uint8_t *)(0xF8018020UL))
#define bFM0P_FASTIO_M_FPDIR0_P3                  *((volatile  uint8_t *)(0xF8018020UL))
#define bFM_FASTIO_M_FPDIR0_P4                    *((volatile  uint8_t *)(0xF8018040UL))
#define bFM0P_FASTIO_M_FPDIR0_P4                  *((volatile  uint8_t *)(0xF8018040UL))
#define bFM_FASTIO_M_FPDIR0_P5                    *((volatile  uint8_t *)(0xF8018080UL))
#define bFM0P_FASTIO_M_FPDIR0_P5                  *((volatile  uint8_t *)(0xF8018080UL))
#define bFM_FASTIO_M_FPDIR0_P6                    *((volatile  uint8_t *)(0xF8018100UL))
#define bFM0P_FASTIO_M_FPDIR0_P6                  *((volatile  uint8_t *)(0xF8018100UL))
#define bFM_FASTIO_M_FPDIR0_P7                    *((volatile  uint8_t *)(0xF8018200UL))
#define bFM0P_FASTIO_M_FPDIR0_P7                  *((volatile  uint8_t *)(0xF8018200UL))

#define bFM_FASTIO_M_FPDIR1_P0                    *((volatile  uint8_t *)(0xF8018404UL))
#define bFM0P_FASTIO_M_FPDIR1_P0                  *((volatile  uint8_t *)(0xF8018404UL))
#define bFM_FASTIO_M_FPDIR1_P1                    *((volatile  uint8_t *)(0xF8018408UL))
#define bFM0P_FASTIO_M_FPDIR1_P1                  *((volatile  uint8_t *)(0xF8018408UL))
#define bFM_FASTIO_M_FPDIR1_P2                    *((volatile  uint8_t *)(0xF8018410UL))
#define bFM0P_FASTIO_M_FPDIR1_P2                  *((volatile  uint8_t *)(0xF8018410UL))
#define bFM_FASTIO_M_FPDIR1_P3                    *((volatile  uint8_t *)(0xF8018420UL))
#define bFM0P_FASTIO_M_FPDIR1_P3                  *((volatile  uint8_t *)(0xF8018420UL))
#define bFM_FASTIO_M_FPDIR1_P4                    *((volatile  uint8_t *)(0xF8018440UL))
#define bFM0P_FASTIO_M_FPDIR1_P4                  *((volatile  uint8_t *)(0xF8018440UL))
#define bFM_FASTIO_M_FPDIR1_P5                    *((volatile  uint8_t *)(0xF8018480UL))
#define bFM0P_FASTIO_M_FPDIR1_P5                  *((volatile  uint8_t *)(0xF8018480UL))
#define bFM_FASTIO_M_FPDIR1_P6                    *((volatile  uint8_t *)(0xF8018500UL))
#define bFM0P_FASTIO_M_FPDIR1_P6                  *((volatile  uint8_t *)(0xF8018500UL))
#define bFM_FASTIO_M_FPDIR1_P7                    *((volatile  uint8_t *)(0xF8018600UL))
#define bFM0P_FASTIO_M_FPDIR1_P7                  *((volatile  uint8_t *)(0xF8018600UL))

