mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xg/common/s6e1b3xg.h
#define bFM_GPIO_DDR5_P0                          *((volatile  uint8_t *)(0x42664280UL))
#define bFM0P_GPIO_DDR5_P0                        *((volatile  uint8_t *)(0x42664280UL))
#define bFM_GPIO_DDR5_P1                          *((volatile  uint8_t *)(0x42664284UL))
#define bFM0P_GPIO_DDR5_P1                        *((volatile  uint8_t *)(0x42664284UL))
#define bFM_GPIO_DDR5_P2                          *((volatile  uint8_t *)(0x42664288UL))
#define bFM0P_GPIO_DDR5_P2                        *((volatile  uint8_t *)(0x42664288UL))
#define bFM_GPIO_DDR5_P3                          *((volatile  uint8_t *)(0x4266428CUL))
#define bFM0P_GPIO_DDR5_P3                        *((volatile  uint8_t *)(0x4266428CUL))
#define bFM_GPIO_DDR5_P4                          *((volatile  uint8_t *)(0x42664290UL))
#define bFM0P_GPIO_DDR5_P4                        *((volatile  uint8_t *)(0x42664290UL))
#define bFM_GPIO_DDR5_P5                          *((volatile  uint8_t *)(0x42664294UL))
#define bFM0P_GPIO_DDR5_P5                        *((volatile  uint8_t *)(0x42664294UL))
#define bFM_GPIO_DDR5_P6                          *((volatile  uint8_t *)(0x42664298UL))
#define bFM0P_GPIO_DDR5_P6                        *((volatile  uint8_t *)(0x42664298UL))
#define bFM_GPIO_DDR5_P7                          *((volatile  uint8_t *)(0x4266429CUL))
#define bFM0P_GPIO_DDR5_P7                        *((volatile  uint8_t *)(0x4266429CUL))
#define bFM_GPIO_DDR5_P8                          *((volatile  uint8_t *)(0x426642A0UL))
#define bFM0P_GPIO_DDR5_P8                        *((volatile  uint8_t *)(0x426642A0UL))
#define bFM_GPIO_DDR5_P9                          *((volatile  uint8_t *)(0x426642A4UL))
#define bFM0P_GPIO_DDR5_P9                        *((volatile  uint8_t *)(0x426642A4UL))
#define bFM_GPIO_DDR5_PA                          *((volatile  uint8_t *)(0x426642A8UL))
#define bFM0P_GPIO_DDR5_PA                        *((volatile  uint8_t *)(0x426642A8UL))
#define bFM_GPIO_DDR5_PB                          *((volatile  uint8_t *)(0x426642ACUL))
#define bFM0P_GPIO_DDR5_PB                        *((volatile  uint8_t *)(0x426642ACUL))

#define bFM_GPIO_DDR6_P0                          *((volatile  uint8_t *)(0x42664300UL))
#define bFM0P_GPIO_DDR6_P0                        *((volatile  uint8_t *)(0x42664300UL))
#define bFM_GPIO_DDR6_P1                          *((volatile  uint8_t *)(0x42664304UL))
#define bFM0P_GPIO_DDR6_P1                        *((volatile  uint8_t *)(0x42664304UL))
#define bFM_GPIO_DDR6_P2                          *((volatile  uint8_t *)(0x42664308UL))
#define bFM0P_GPIO_DDR6_P2                        *((volatile  uint8_t *)(0x42664308UL))
#define bFM_GPIO_DDR6_P3                          *((volatile  uint8_t *)(0x4266430CUL))
#define bFM0P_GPIO_DDR6_P3                        *((volatile  uint8_t *)(0x4266430CUL))
#define bFM_GPIO_DDR6_P4                          *((volatile  uint8_t *)(0x42664310UL))
#define bFM0P_GPIO_DDR6_P4                        *((volatile  uint8_t *)(0x42664310UL))
#define bFM_GPIO_DDR6_P5                          *((volatile  uint8_t *)(0x42664314UL))
#define bFM0P_GPIO_DDR6_P5                        *((volatile  uint8_t *)(0x42664314UL))
#define bFM_GPIO_DDR6_P6                          *((volatile  uint8_t *)(0x42664318UL))
#define bFM0P_GPIO_DDR6_P6                        *((volatile  uint8_t *)(0x42664318UL))
#define bFM_GPIO_DDR6_P7                          *((volatile  uint8_t *)(0x4266431CUL))
#define bFM0P_GPIO_DDR6_P7                        *((volatile  uint8_t *)(0x4266431CUL))
#define bFM_GPIO_DDR6_P8                          *((volatile  uint8_t *)(0x42664320UL))
#define bFM0P_GPIO_DDR6_P8                        *((volatile  uint8_t *)(0x42664320UL))

#define bFM_GPIO_DDR7_P0                          *((volatile  uint8_t *)(0x42664380UL))
#define bFM0P_GPIO_DDR7_P0                        *((volatile  uint8_t *)(0x42664380UL))
#define bFM_GPIO_DDR7_P1                          *((volatile  uint8_t *)(0x42664384UL))
#define bFM0P_GPIO_DDR7_P1                        *((volatile  uint8_t *)(0x42664384UL))
#define bFM_GPIO_DDR7_P2                          *((volatile  uint8_t *)(0x42664388UL))
#define bFM0P_GPIO_DDR7_P2                        *((volatile  uint8_t *)(0x42664388UL))
#define bFM_GPIO_DDR7_P3                          *((volatile  uint8_t *)(0x4266438CUL))
#define bFM0P_GPIO_DDR7_P3                        *((volatile  uint8_t *)(0x4266438CUL))
#define bFM_GPIO_DDR7_P4                          *((volatile  uint8_t *)(0x42664390UL))
#define bFM0P_GPIO_DDR7_P4                        *((volatile  uint8_t *)(0x42664390UL))

#define bFM_GPIO_DDR8_P0                          *((volatile  uint8_t *)(0x42664400UL))
#define bFM0P_GPIO_DDR8_P0                        *((volatile  uint8_t *)(0x42664400UL))
#define bFM_GPIO_DDR8_P1                          *((volatile  uint8_t *)(0x42664404UL))
#define bFM0P_GPIO_DDR8_P1                        *((volatile  uint8_t *)(0x42664404UL))
#define bFM_GPIO_DDR8_P2                          *((volatile  uint8_t *)(0x42664408UL))
#define bFM0P_GPIO_DDR8_P2                        *((volatile  uint8_t *)(0x42664408UL))

#define bFM_GPIO_DDRE_P0                          *((volatile  uint8_t *)(0x42664700UL))
#define bFM0P_GPIO_DDRE_P0                        *((volatile  uint8_t *)(0x42664700UL))
#define bFM_GPIO_DDRE_P2                          *((volatile  uint8_t *)(0x42664708UL))
#define bFM0P_GPIO_DDRE_P2                        *((volatile  uint8_t *)(0x42664708UL))
#define bFM_GPIO_DDRE_P3                          *((volatile  uint8_t *)(0x4266470CUL))
#define bFM0P_GPIO_DDRE_P3                        *((volatile  uint8_t *)(0x4266470CUL))

#define bFM_GPIO_EPFR00_NMIS                      *((volatile  uint8_t *)(0x4266C000UL))
#define bFM0P_GPIO_EPFR00_NMIS                    *((volatile  uint8_t *)(0x4266C000UL))
#define bFM_GPIO_EPFR00_USBP0E                    *((volatile  uint8_t *)(0x4266C024UL))
#define bFM0P_GPIO_EPFR00_USBP0E                  *((volatile  uint8_t *)(0x4266C024UL))
#define bFM_GPIO_EPFR00_SWDEN                     *((volatile  uint8_t *)(0x4266C040UL))
#define bFM0P_GPIO_EPFR00_SWDEN                   *((volatile  uint8_t *)(0x4266C040UL))

