mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xg/common/s6e1b3xg.h
#define bFM_GPIO_PDOR5_P0                         *((volatile  uint8_t *)(0x42668280UL))
#define bFM0P_GPIO_PDOR5_P0                       *((volatile  uint8_t *)(0x42668280UL))
#define bFM_GPIO_PDOR5_P1                         *((volatile  uint8_t *)(0x42668284UL))
#define bFM0P_GPIO_PDOR5_P1                       *((volatile  uint8_t *)(0x42668284UL))
#define bFM_GPIO_PDOR5_P2                         *((volatile  uint8_t *)(0x42668288UL))
#define bFM0P_GPIO_PDOR5_P2                       *((volatile  uint8_t *)(0x42668288UL))
#define bFM_GPIO_PDOR5_P3                         *((volatile  uint8_t *)(0x4266828CUL))
#define bFM0P_GPIO_PDOR5_P3                       *((volatile  uint8_t *)(0x4266828CUL))
#define bFM_GPIO_PDOR5_P4                         *((volatile  uint8_t *)(0x42668290UL))
#define bFM0P_GPIO_PDOR5_P4                       *((volatile  uint8_t *)(0x42668290UL))
#define bFM_GPIO_PDOR5_P5                         *((volatile  uint8_t *)(0x42668294UL))
#define bFM0P_GPIO_PDOR5_P5                       *((volatile  uint8_t *)(0x42668294UL))
#define bFM_GPIO_PDOR5_P6                         *((volatile  uint8_t *)(0x42668298UL))
#define bFM0P_GPIO_PDOR5_P6                       *((volatile  uint8_t *)(0x42668298UL))
#define bFM_GPIO_PDOR5_P7                         *((volatile  uint8_t *)(0x4266829CUL))
#define bFM0P_GPIO_PDOR5_P7                       *((volatile  uint8_t *)(0x4266829CUL))
#define bFM_GPIO_PDOR5_P8                         *((volatile  uint8_t *)(0x426682A0UL))
#define bFM0P_GPIO_PDOR5_P8                       *((volatile  uint8_t *)(0x426682A0UL))
#define bFM_GPIO_PDOR5_P9                         *((volatile  uint8_t *)(0x426682A4UL))
#define bFM0P_GPIO_PDOR5_P9                       *((volatile  uint8_t *)(0x426682A4UL))
#define bFM_GPIO_PDOR5_PA                         *((volatile  uint8_t *)(0x426682A8UL))
#define bFM0P_GPIO_PDOR5_PA                       *((volatile  uint8_t *)(0x426682A8UL))
#define bFM_GPIO_PDOR5_PB                         *((volatile  uint8_t *)(0x426682ACUL))
#define bFM0P_GPIO_PDOR5_PB                       *((volatile  uint8_t *)(0x426682ACUL))

#define bFM_GPIO_PDOR6_P0                         *((volatile  uint8_t *)(0x42668300UL))
#define bFM0P_GPIO_PDOR6_P0                       *((volatile  uint8_t *)(0x42668300UL))
#define bFM_GPIO_PDOR6_P1                         *((volatile  uint8_t *)(0x42668304UL))
#define bFM0P_GPIO_PDOR6_P1                       *((volatile  uint8_t *)(0x42668304UL))
#define bFM_GPIO_PDOR6_P2                         *((volatile  uint8_t *)(0x42668308UL))
#define bFM0P_GPIO_PDOR6_P2                       *((volatile  uint8_t *)(0x42668308UL))
#define bFM_GPIO_PDOR6_P3                         *((volatile  uint8_t *)(0x4266830CUL))
#define bFM0P_GPIO_PDOR6_P3                       *((volatile  uint8_t *)(0x4266830CUL))
#define bFM_GPIO_PDOR6_P4                         *((volatile  uint8_t *)(0x42668310UL))
#define bFM0P_GPIO_PDOR6_P4                       *((volatile  uint8_t *)(0x42668310UL))
#define bFM_GPIO_PDOR6_P5                         *((volatile  uint8_t *)(0x42668314UL))
#define bFM0P_GPIO_PDOR6_P5                       *((volatile  uint8_t *)(0x42668314UL))
#define bFM_GPIO_PDOR6_P6                         *((volatile  uint8_t *)(0x42668318UL))
#define bFM0P_GPIO_PDOR6_P6                       *((volatile  uint8_t *)(0x42668318UL))
#define bFM_GPIO_PDOR6_P7                         *((volatile  uint8_t *)(0x4266831CUL))
#define bFM0P_GPIO_PDOR6_P7                       *((volatile  uint8_t *)(0x4266831CUL))
#define bFM_GPIO_PDOR6_P8                         *((volatile  uint8_t *)(0x42668320UL))
#define bFM0P_GPIO_PDOR6_P8                       *((volatile  uint8_t *)(0x42668320UL))

#define bFM_GPIO_PDOR7_P0                         *((volatile  uint8_t *)(0x42668380UL))
#define bFM0P_GPIO_PDOR7_P0                       *((volatile  uint8_t *)(0x42668380UL))
#define bFM_GPIO_PDOR7_P1                         *((volatile  uint8_t *)(0x42668384UL))
#define bFM0P_GPIO_PDOR7_P1                       *((volatile  uint8_t *)(0x42668384UL))
#define bFM_GPIO_PDOR7_P2                         *((volatile  uint8_t *)(0x42668388UL))
#define bFM0P_GPIO_PDOR7_P2                       *((volatile  uint8_t *)(0x42668388UL))
#define bFM_GPIO_PDOR7_P3                         *((volatile  uint8_t *)(0x4266838CUL))
#define bFM0P_GPIO_PDOR7_P3                       *((volatile  uint8_t *)(0x4266838CUL))
#define bFM_GPIO_PDOR7_P4                         *((volatile  uint8_t *)(0x42668390UL))
#define bFM0P_GPIO_PDOR7_P4                       *((volatile  uint8_t *)(0x42668390UL))

#define bFM_GPIO_PDOR8_P0                         *((volatile  uint8_t *)(0x42668400UL))
#define bFM0P_GPIO_PDOR8_P0                       *((volatile  uint8_t *)(0x42668400UL))
#define bFM_GPIO_PDOR8_P1                         *((volatile  uint8_t *)(0x42668404UL))
#define bFM0P_GPIO_PDOR8_P1                       *((volatile  uint8_t *)(0x42668404UL))
#define bFM_GPIO_PDOR8_P2                         *((volatile  uint8_t *)(0x42668408UL))
#define bFM0P_GPIO_PDOR8_P2                       *((volatile  uint8_t *)(0x42668408UL))

#define bFM_GPIO_PDORE_P0                         *((volatile  uint8_t *)(0x42668700UL))
#define bFM0P_GPIO_PDORE_P0                       *((volatile  uint8_t *)(0x42668700UL))
#define bFM_GPIO_PDORE_P2                         *((volatile  uint8_t *)(0x42668708UL))
#define bFM0P_GPIO_PDORE_P2                       *((volatile  uint8_t *)(0x42668708UL))
#define bFM_GPIO_PDORE_P3                         *((volatile  uint8_t *)(0x4266870CUL))
#define bFM0P_GPIO_PDORE_P3                       *((volatile  uint8_t *)(0x4266870CUL))

#define bFM_GPIO_PFR0_P0                          *((volatile  uint8_t *)(0x42660000UL))
#define bFM0P_GPIO_PFR0_P0                        *((volatile  uint8_t *)(0x42660000UL))
#define bFM_GPIO_PFR0_P1                          *((volatile  uint8_t *)(0x42660004UL))
#define bFM0P_GPIO_PFR0_P1                        *((volatile  uint8_t *)(0x42660004UL))
#define bFM_GPIO_PFR0_P2                          *((volatile  uint8_t *)(0x42660008UL))
#define bFM0P_GPIO_PFR0_P2                        *((volatile  uint8_t *)(0x42660008UL))
#define bFM_GPIO_PFR0_P3                          *((volatile  uint8_t *)(0x4266000CUL))
#define bFM0P_GPIO_PFR0_P3                        *((volatile  uint8_t *)(0x4266000CUL))
#define bFM_GPIO_PFR0_P4                          *((volatile  uint8_t *)(0x42660010UL))
#define bFM0P_GPIO_PFR0_P4                        *((volatile  uint8_t *)(0x42660010UL))
#define bFM_GPIO_PFR0_P5                          *((volatile  uint8_t *)(0x42660014UL))
#define bFM0P_GPIO_PFR0_P5                        *((volatile  uint8_t *)(0x42660014UL))
#define bFM_GPIO_PFR0_P6                          *((volatile  uint8_t *)(0x42660018UL))
#define bFM0P_GPIO_PFR0_P6                        *((volatile  uint8_t *)(0x42660018UL))
#define bFM_GPIO_PFR0_P7                          *((volatile  uint8_t *)(0x4266001CUL))
#define bFM0P_GPIO_PFR0_P7                        *((volatile  uint8_t *)(0x4266001CUL))
#define bFM_GPIO_PFR0_P8                          *((volatile  uint8_t *)(0x42660020UL))
#define bFM0P_GPIO_PFR0_P8                        *((volatile  uint8_t *)(0x42660020UL))
#define bFM_GPIO_PFR0_P9                          *((volatile  uint8_t *)(0x42660024UL))
#define bFM0P_GPIO_PFR0_P9                        *((volatile  uint8_t *)(0x42660024UL))
#define bFM_GPIO_PFR0_PA                          *((volatile  uint8_t *)(0x42660028UL))
#define bFM0P_GPIO_PFR0_PA                        *((volatile  uint8_t *)(0x42660028UL))
#define bFM_GPIO_PFR0_PB                          *((volatile  uint8_t *)(0x4266002CUL))
#define bFM0P_GPIO_PFR0_PB                        *((volatile  uint8_t *)(0x4266002CUL))
#define bFM_GPIO_PFR0_PC                          *((volatile  uint8_t *)(0x42660030UL))
#define bFM0P_GPIO_PFR0_PC                        *((volatile  uint8_t *)(0x42660030UL))
#define bFM_GPIO_PFR0_PD                          *((volatile  uint8_t *)(0x42660034UL))
#define bFM0P_GPIO_PFR0_PD                        *((volatile  uint8_t *)(0x42660034UL))
#define bFM_GPIO_PFR0_PE                          *((volatile  uint8_t *)(0x42660038UL))
#define bFM0P_GPIO_PFR0_PE                        *((volatile  uint8_t *)(0x42660038UL))
#define bFM_GPIO_PFR0_PF                          *((volatile  uint8_t *)(0x4266003CUL))
#define bFM0P_GPIO_PFR0_PF                        *((volatile  uint8_t *)(0x4266003CUL))

#define bFM_GPIO_PFR1_P0                          *((volatile  uint8_t *)(0x42660080UL))
#define bFM0P_GPIO_PFR1_P0                        *((volatile  uint8_t *)(0x42660080UL))
#define bFM_GPIO_PFR1_P1                          *((volatile  uint8_t *)(0x42660084UL))
#define bFM0P_GPIO_PFR1_P1                        *((volatile  uint8_t *)(0x42660084UL))
#define bFM_GPIO_PFR1_P2                          *((volatile  uint8_t *)(0x42660088UL))
#define bFM0P_GPIO_PFR1_P2                        *((volatile  uint8_t *)(0x42660088UL))
#define bFM_GPIO_PFR1_P3                          *((volatile  uint8_t *)(0x4266008CUL))
#define bFM0P_GPIO_PFR1_P3                        *((volatile  uint8_t *)(0x4266008CUL))
#define bFM_GPIO_PFR1_P4                          *((volatile  uint8_t *)(0x42660090UL))
#define bFM0P_GPIO_PFR1_P4                        *((volatile  uint8_t *)(0x42660090UL))
#define bFM_GPIO_PFR1_P5                          *((volatile  uint8_t *)(0x42660094UL))
#define bFM0P_GPIO_PFR1_P5                        *((volatile  uint8_t *)(0x42660094UL))
#define bFM_GPIO_PFR1_P6                          *((volatile  uint8_t *)(0x42660098UL))
#define bFM0P_GPIO_PFR1_P6                        *((volatile  uint8_t *)(0x42660098UL))
#define bFM_GPIO_PFR1_P7                          *((volatile  uint8_t *)(0x4266009CUL))
#define bFM0P_GPIO_PFR1_P7                        *((volatile  uint8_t *)(0x4266009CUL))
#define bFM_GPIO_PFR1_P8                          *((volatile  uint8_t *)(0x426600A0UL))
#define bFM0P_GPIO_PFR1_P8                        *((volatile  uint8_t *)(0x426600A0UL))
#define bFM_GPIO_PFR1_P9                          *((volatile  uint8_t *)(0x426600A4UL))
#define bFM0P_GPIO_PFR1_P9                        *((volatile  uint8_t *)(0x426600A4UL))
#define bFM_GPIO_PFR1_PA                          *((volatile  uint8_t *)(0x426600A8UL))
#define bFM0P_GPIO_PFR1_PA                        *((volatile  uint8_t *)(0x426600A8UL))
#define bFM_GPIO_PFR1_PB                          *((volatile  uint8_t *)(0x426600ACUL))
#define bFM0P_GPIO_PFR1_PB                        *((volatile  uint8_t *)(0x426600ACUL))
#define bFM_GPIO_PFR1_PC                          *((volatile  uint8_t *)(0x426600B0UL))
#define bFM0P_GPIO_PFR1_PC                        *((volatile  uint8_t *)(0x426600B0UL))
#define bFM_GPIO_PFR1_PD                          *((volatile  uint8_t *)(0x426600B4UL))
#define bFM0P_GPIO_PFR1_PD                        *((volatile  uint8_t *)(0x426600B4UL))
#define bFM_GPIO_PFR1_PE                          *((volatile  uint8_t *)(0x426600B8UL))
#define bFM0P_GPIO_PFR1_PE                        *((volatile  uint8_t *)(0x426600B8UL))

#define bFM_GPIO_PFR2_P0                          *((volatile  uint8_t *)(0x42660100UL))
#define bFM0P_GPIO_PFR2_P0                        *((volatile  uint8_t *)(0x42660100UL))
#define bFM_GPIO_PFR2_P1                          *((volatile  uint8_t *)(0x42660104UL))
#define bFM0P_GPIO_PFR2_P1                        *((volatile  uint8_t *)(0x42660104UL))
#define bFM_GPIO_PFR2_P2                          *((volatile  uint8_t *)(0x42660108UL))
#define bFM0P_GPIO_PFR2_P2                        *((volatile  uint8_t *)(0x42660108UL))
#define bFM_GPIO_PFR2_P3                          *((volatile  uint8_t *)(0x4266010CUL))
#define bFM0P_GPIO_PFR2_P3                        *((volatile  uint8_t *)(0x4266010CUL))
#define bFM_GPIO_PFR2_P4                          *((volatile  uint8_t *)(0x42660110UL))
#define bFM0P_GPIO_PFR2_P4                        *((volatile  uint8_t *)(0x42660110UL))
#define bFM_GPIO_PFR2_P5                          *((volatile  uint8_t *)(0x42660114UL))
#define bFM0P_GPIO_PFR2_P5                        *((volatile  uint8_t *)(0x42660114UL))
#define bFM_GPIO_PFR2_P6                          *((volatile  uint8_t *)(0x42660118UL))
#define bFM0P_GPIO_PFR2_P6                        *((volatile  uint8_t *)(0x42660118UL))
#define bFM_GPIO_PFR2_P7                          *((volatile  uint8_t *)(0x4266011CUL))
#define bFM0P_GPIO_PFR2_P7                        *((volatile  uint8_t *)(0x4266011CUL))
#define bFM_GPIO_PFR2_P8                          *((volatile  uint8_t *)(0x42660120UL))
#define bFM0P_GPIO_PFR2_P8                        *((volatile  uint8_t *)(0x42660120UL))

#define bFM_GPIO_PFR3_P0                          *((volatile  uint8_t *)(0x42660180UL))
#define bFM0P_GPIO_PFR3_P0                        *((volatile  uint8_t *)(0x42660180UL))
#define bFM_GPIO_PFR3_P1                          *((volatile  uint8_t *)(0x42660184UL))
#define bFM0P_GPIO_PFR3_P1                        *((volatile  uint8_t *)(0x42660184UL))
#define bFM_GPIO_PFR3_P2                          *((volatile  uint8_t *)(0x42660188UL))
#define bFM0P_GPIO_PFR3_P2                        *((volatile  uint8_t *)(0x42660188UL))
#define bFM_GPIO_PFR3_P3                          *((volatile  uint8_t *)(0x4266018CUL))
#define bFM0P_GPIO_PFR3_P3                        *((volatile  uint8_t *)(0x4266018CUL))
#define bFM_GPIO_PFR3_P4                          *((volatile  uint8_t *)(0x42660190UL))
#define bFM0P_GPIO_PFR3_P4                        *((volatile  uint8_t *)(0x42660190UL))
#define bFM_GPIO_PFR3_P5                          *((volatile  uint8_t *)(0x42660194UL))
#define bFM0P_GPIO_PFR3_P5                        *((volatile  uint8_t *)(0x42660194UL))
#define bFM_GPIO_PFR3_P6                          *((volatile  uint8_t *)(0x42660198UL))
#define bFM0P_GPIO_PFR3_P6                        *((volatile  uint8_t *)(0x42660198UL))
#define bFM_GPIO_PFR3_P7                          *((volatile  uint8_t *)(0x4266019CUL))
#define bFM0P_GPIO_PFR3_P7                        *((volatile  uint8_t *)(0x4266019CUL))
#define bFM_GPIO_PFR3_P8                          *((volatile  uint8_t *)(0x426601A0UL))
#define bFM0P_GPIO_PFR3_P8                        *((volatile  uint8_t *)(0x426601A0UL))
#define bFM_GPIO_PFR3_P9                          *((volatile  uint8_t *)(0x426601A4UL))
#define bFM0P_GPIO_PFR3_P9                        *((volatile  uint8_t *)(0x426601A4UL))
#define bFM_GPIO_PFR3_PA                          *((volatile  uint8_t *)(0x426601A8UL))
#define bFM0P_GPIO_PFR3_PA                        *((volatile  uint8_t *)(0x426601A8UL))
#define bFM_GPIO_PFR3_PB                          *((volatile  uint8_t *)(0x426601ACUL))
#define bFM0P_GPIO_PFR3_PB                        *((volatile  uint8_t *)(0x426601ACUL))
#define bFM_GPIO_PFR3_PC                          *((volatile  uint8_t *)(0x426601B0UL))
#define bFM0P_GPIO_PFR3_PC                        *((volatile  uint8_t *)(0x426601B0UL))
#define bFM_GPIO_PFR3_PD                          *((volatile  uint8_t *)(0x426601B4UL))
#define bFM0P_GPIO_PFR3_PD                        *((volatile  uint8_t *)(0x426601B4UL))
#define bFM_GPIO_PFR3_PE                          *((volatile  uint8_t *)(0x426601B8UL))
#define bFM0P_GPIO_PFR3_PE                        *((volatile  uint8_t *)(0x426601B8UL))
#define bFM_GPIO_PFR3_PF                          *((volatile  uint8_t *)(0x426601BCUL))
#define bFM0P_GPIO_PFR3_PF                        *((volatile  uint8_t *)(0x426601BCUL))

#define bFM_GPIO_PFR4_P0                          *((volatile  uint16_t*)(0x42660200UL))
#define bFM0P_GPIO_PFR4_P0                        *((volatile  uint16_t*)(0x42660200UL))
#define bFM_GPIO_PFR4_P1                          *((volatile  uint16_t*)(0x42660204UL))
#define bFM0P_GPIO_PFR4_P1                        *((volatile  uint16_t*)(0x42660204UL))
#define bFM_GPIO_PFR4_P2                          *((volatile  uint16_t*)(0x42660208UL))
#define bFM0P_GPIO_PFR4_P2                        *((volatile  uint16_t*)(0x42660208UL))
#define bFM_GPIO_PFR4_P3                          *((volatile  uint16_t*)(0x4266020CUL))
#define bFM0P_GPIO_PFR4_P3                        *((volatile  uint16_t*)(0x4266020CUL))
#define bFM_GPIO_PFR4_P4                          *((volatile  uint16_t*)(0x42660210UL))
#define bFM0P_GPIO_PFR4_P4                        *((volatile  uint16_t*)(0x42660210UL))
#define bFM_GPIO_PFR4_P5                          *((volatile  uint16_t*)(0x42660214UL))
#define bFM0P_GPIO_PFR4_P5                        *((volatile  uint16_t*)(0x42660214UL))
#define bFM_GPIO_PFR4_P6                          *((volatile  uint16_t*)(0x42660218UL))
#define bFM0P_GPIO_PFR4_P6                        *((volatile  uint16_t*)(0x42660218UL))
#define bFM_GPIO_PFR4_P7                          *((volatile  uint16_t*)(0x4266021CUL))
#define bFM0P_GPIO_PFR4_P7                        *((volatile  uint16_t*)(0x4266021CUL))
#define bFM_GPIO_PFR4_P8                          *((volatile  uint16_t*)(0x42660220UL))
#define bFM0P_GPIO_PFR4_P8                        *((volatile  uint16_t*)(0x42660220UL))
#define bFM_GPIO_PFR4_P9                          *((volatile  uint16_t*)(0x42660224UL))
#define bFM0P_GPIO_PFR4_P9                        *((volatile  uint16_t*)(0x42660224UL))
#define bFM_GPIO_PFR4_PA                          *((volatile  uint16_t*)(0x42660228UL))
#define bFM0P_GPIO_PFR4_PA                        *((volatile  uint16_t*)(0x42660228UL))
#define bFM_GPIO_PFR4_PB                          *((volatile  uint16_t*)(0x4266022CUL))
#define bFM0P_GPIO_PFR4_PB                        *((volatile  uint16_t*)(0x4266022CUL))
#define bFM_GPIO_PFR4_PC                          *((volatile  uint16_t*)(0x42660230UL))
#define bFM0P_GPIO_PFR4_PC                        *((volatile  uint16_t*)(0x42660230UL))
#define bFM_GPIO_PFR4_PD                          *((volatile  uint16_t*)(0x42660234UL))
#define bFM0P_GPIO_PFR4_PD                        *((volatile  uint16_t*)(0x42660234UL))

#define bFM_GPIO_PFR5_P0                          *((volatile  uint8_t *)(0x42660280UL))
#define bFM0P_GPIO_PFR5_P0                        *((volatile  uint8_t *)(0x42660280UL))
#define bFM_GPIO_PFR5_P1                          *((volatile  uint8_t *)(0x42660284UL))
#define bFM0P_GPIO_PFR5_P1                        *((volatile  uint8_t *)(0x42660284UL))
#define bFM_GPIO_PFR5_P2                          *((volatile  uint8_t *)(0x42660288UL))
#define bFM0P_GPIO_PFR5_P2                        *((volatile  uint8_t *)(0x42660288UL))
#define bFM_GPIO_PFR5_P3                          *((volatile  uint8_t *)(0x4266028CUL))
#define bFM0P_GPIO_PFR5_P3                        *((volatile  uint8_t *)(0x4266028CUL))
#define bFM_GPIO_PFR5_P4                          *((volatile  uint8_t *)(0x42660290UL))
#define bFM0P_GPIO_PFR5_P4                        *((volatile  uint8_t *)(0x42660290UL))
#define bFM_GPIO_PFR5_P5                          *((volatile  uint8_t *)(0x42660294UL))
#define bFM0P_GPIO_PFR5_P5                        *((volatile  uint8_t *)(0x42660294UL))
#define bFM_GPIO_PFR5_P6                          *((volatile  uint8_t *)(0x42660298UL))
#define bFM0P_GPIO_PFR5_P6                        *((volatile  uint8_t *)(0x42660298UL))
#define bFM_GPIO_PFR5_P7                          *((volatile  uint8_t *)(0x4266029CUL))
#define bFM0P_GPIO_PFR5_P7                        *((volatile  uint8_t *)(0x4266029CUL))
#define bFM_GPIO_PFR5_P8                          *((volatile  uint8_t *)(0x426602A0UL))
#define bFM0P_GPIO_PFR5_P8                        *((volatile  uint8_t *)(0x426602A0UL))
#define bFM_GPIO_PFR5_P9                          *((volatile  uint8_t *)(0x426602A4UL))
#define bFM0P_GPIO_PFR5_P9                        *((volatile  uint8_t *)(0x426602A4UL))
#define bFM_GPIO_PFR5_PA                          *((volatile  uint8_t *)(0x426602A8UL))
#define bFM0P_GPIO_PFR5_PA                        *((volatile  uint8_t *)(0x426602A8UL))
#define bFM_GPIO_PFR5_PB                          *((volatile  uint8_t *)(0x426602ACUL))
#define bFM0P_GPIO_PFR5_PB                        *((volatile  uint8_t *)(0x426602ACUL))

#define bFM_GPIO_PFR6_P0                          *((volatile  uint8_t *)(0x42660300UL))
#define bFM0P_GPIO_PFR6_P0                        *((volatile  uint8_t *)(0x42660300UL))
#define bFM_GPIO_PFR6_P1                          *((volatile  uint8_t *)(0x42660304UL))
#define bFM0P_GPIO_PFR6_P1                        *((volatile  uint8_t *)(0x42660304UL))
#define bFM_GPIO_PFR6_P2                          *((volatile  uint8_t *)(0x42660308UL))
#define bFM0P_GPIO_PFR6_P2                        *((volatile  uint8_t *)(0x42660308UL))
#define bFM_GPIO_PFR6_P3                          *((volatile  uint8_t *)(0x4266030CUL))
#define bFM0P_GPIO_PFR6_P3                        *((volatile  uint8_t *)(0x4266030CUL))
#define bFM_GPIO_PFR6_P4                          *((volatile  uint8_t *)(0x42660310UL))
#define bFM0P_GPIO_PFR6_P4                        *((volatile  uint8_t *)(0x42660310UL))
#define bFM_GPIO_PFR6_P5                          *((volatile  uint8_t *)(0x42660314UL))
#define bFM0P_GPIO_PFR6_P5                        *((volatile  uint8_t *)(0x42660314UL))
#define bFM_GPIO_PFR6_P6                          *((volatile  uint8_t *)(0x42660318UL))
#define bFM0P_GPIO_PFR6_P6                        *((volatile  uint8_t *)(0x42660318UL))
#define bFM_GPIO_PFR6_P7                          *((volatile  uint8_t *)(0x4266031CUL))
#define bFM0P_GPIO_PFR6_P7                        *((volatile  uint8_t *)(0x4266031CUL))
#define bFM_GPIO_PFR6_P8                          *((volatile  uint8_t *)(0x42660320UL))
#define bFM0P_GPIO_PFR6_P8                        *((volatile  uint8_t *)(0x42660320UL))

#define bFM_GPIO_PFR7_P0                          *((volatile  uint8_t *)(0x42660380UL))
#define bFM0P_GPIO_PFR7_P0                        *((volatile  uint8_t *)(0x42660380UL))
#define bFM_GPIO_PFR7_P1                          *((volatile  uint8_t *)(0x42660384UL))
#define bFM0P_GPIO_PFR7_P1                        *((volatile  uint8_t *)(0x42660384UL))
#define bFM_GPIO_PFR7_P2                          *((volatile  uint8_t *)(0x42660388UL))
#define bFM0P_GPIO_PFR7_P2                        *((volatile  uint8_t *)(0x42660388UL))
#define bFM_GPIO_PFR7_P3                          *((volatile  uint8_t *)(0x4266038CUL))
#define bFM0P_GPIO_PFR7_P3                        *((volatile  uint8_t *)(0x4266038CUL))
#define bFM_GPIO_PFR7_P4                          *((volatile  uint8_t *)(0x42660390UL))
#define bFM0P_GPIO_PFR7_P4                        *((volatile  uint8_t *)(0x42660390UL))

