mdhardenburgh/Cypress_PDL_2.1.0/devices/fm0p/s6e1b3xg/common/s6e1b3xg.h
#define bFM_MFS2_CSIO_SCSFR1_CS2BDS               *((volatile  uint8_t *)(0x427046B0UL))
#define bFM0P_MFS2_CSIO_SCSFR1_CS2BDS             *((volatile  uint8_t *)(0x427046B0UL))
#define bFM_MFS2_CSIO_SCSFR1_CS2SPI               *((volatile  uint8_t *)(0x427046B4UL))
#define bFM0P_MFS2_CSIO_SCSFR1_CS2SPI             *((volatile  uint8_t *)(0x427046B4UL))
#define bFM_MFS2_CSIO_SCSFR1_CS2SCINV             *((volatile  uint8_t *)(0x427046B8UL))
#define bFM0P_MFS2_CSIO_SCSFR1_CS2SCINV           *((volatile  uint8_t *)(0x427046B8UL))
#define bFM_MFS2_CSIO_SCSFR1_CS2CSLVL             *((volatile  uint8_t *)(0x427046BCUL))
#define bFM0P_MFS2_CSIO_SCSFR1_CS2CSLVL           *((volatile  uint8_t *)(0x427046BCUL))

#define bFM_MFS2_CSIO_SCSFR2_CS3BDS               *((volatile  uint8_t *)(0x42704710UL))
#define bFM0P_MFS2_CSIO_SCSFR2_CS3BDS             *((volatile  uint8_t *)(0x42704710UL))
#define bFM_MFS2_CSIO_SCSFR2_CS3SPI               *((volatile  uint8_t *)(0x42704714UL))
#define bFM0P_MFS2_CSIO_SCSFR2_CS3SPI             *((volatile  uint8_t *)(0x42704714UL))
#define bFM_MFS2_CSIO_SCSFR2_CS3SCINV             *((volatile  uint8_t *)(0x42704718UL))
#define bFM0P_MFS2_CSIO_SCSFR2_CS3SCINV           *((volatile  uint8_t *)(0x42704718UL))
#define bFM_MFS2_CSIO_SCSFR2_CS3CSLVL             *((volatile  uint8_t *)(0x4270471CUL))
#define bFM0P_MFS2_CSIO_SCSFR2_CS3CSLVL           *((volatile  uint8_t *)(0x4270471CUL))

#define bFM_MFS2_CSIO_SMR_SOE                     *((volatile  uint8_t *)(0x42704000UL))
#define bFM0P_MFS2_CSIO_SMR_SOE                   *((volatile  uint8_t *)(0x42704000UL))
#define bFM_MFS2_CSIO_SMR_SCKE                    *((volatile  uint8_t *)(0x42704004UL))
#define bFM0P_MFS2_CSIO_SMR_SCKE                  *((volatile  uint8_t *)(0x42704004UL))
#define bFM_MFS2_CSIO_SMR_BDS                     *((volatile  uint8_t *)(0x42704008UL))
#define bFM0P_MFS2_CSIO_SMR_BDS                   *((volatile  uint8_t *)(0x42704008UL))
#define bFM_MFS2_CSIO_SMR_SCINV                   *((volatile  uint8_t *)(0x4270400CUL))
#define bFM0P_MFS2_CSIO_SMR_SCINV                 *((volatile  uint8_t *)(0x4270400CUL))

#define bFM_MFS2_CSIO_SSR_TBI                     *((volatile  uint8_t *)(0x427040A0UL))
#define bFM0P_MFS2_CSIO_SSR_TBI                   *((volatile  uint8_t *)(0x427040A0UL))
#define bFM_MFS2_CSIO_SSR_TDRE                    *((volatile  uint8_t *)(0x427040A4UL))
#define bFM0P_MFS2_CSIO_SSR_TDRE                  *((volatile  uint8_t *)(0x427040A4UL))
#define bFM_MFS2_CSIO_SSR_RDRF                    *((volatile  uint8_t *)(0x427040A8UL))
#define bFM0P_MFS2_CSIO_SSR_RDRF                  *((volatile  uint8_t *)(0x427040A8UL))
#define bFM_MFS2_CSIO_SSR_ORE                     *((volatile  uint8_t *)(0x427040ACUL))
#define bFM0P_MFS2_CSIO_SSR_ORE                   *((volatile  uint8_t *)(0x427040ACUL))
#define bFM_MFS2_CSIO_SSR_REC                     *((volatile  uint8_t *)(0x427040BCUL))
#define bFM0P_MFS2_CSIO_SSR_REC                   *((volatile  uint8_t *)(0x427040BCUL))

#define bFM_MFS2_I2C_EIBCR_BEC                    *((volatile  uint8_t *)(0x427043A0UL))
#define bFM0P_MFS2_I2C_EIBCR_BEC                  *((volatile  uint8_t *)(0x427043A0UL))
#define bFM_MFS2_I2C_EIBCR_SOCE                   *((volatile  uint8_t *)(0x427043A4UL))
#define bFM0P_MFS2_I2C_EIBCR_SOCE                 *((volatile  uint8_t *)(0x427043A4UL))
#define bFM_MFS2_I2C_EIBCR_SCLC                   *((volatile  uint8_t *)(0x427043A8UL))
#define bFM0P_MFS2_I2C_EIBCR_SCLC                 *((volatile  uint8_t *)(0x427043A8UL))
#define bFM_MFS2_I2C_EIBCR_SDAC                   *((volatile  uint8_t *)(0x427043ACUL))
#define bFM0P_MFS2_I2C_EIBCR_SDAC                 *((volatile  uint8_t *)(0x427043ACUL))
#define bFM_MFS2_I2C_EIBCR_SCLS                   *((volatile  uint8_t *)(0x427043B0UL))
#define bFM0P_MFS2_I2C_EIBCR_SCLS                 *((volatile  uint8_t *)(0x427043B0UL))
#define bFM_MFS2_I2C_EIBCR_SDAS                   *((volatile  uint8_t *)(0x427043B4UL))
#define bFM0P_MFS2_I2C_EIBCR_SDAS                 *((volatile  uint8_t *)(0x427043B4UL))

#define bFM_MFS2_I2C_FCR_FE1                      *((volatile  uint8_t *)(0x42704280UL))
#define bFM0P_MFS2_I2C_FCR_FE1                    *((volatile  uint8_t *)(0x42704280UL))
#define bFM_MFS2_I2C_FCR_FE2                      *((volatile  uint8_t *)(0x42704284UL))
#define bFM0P_MFS2_I2C_FCR_FE2                    *((volatile  uint8_t *)(0x42704284UL))
#define bFM_MFS2_I2C_FCR_FCL1                     *((volatile  uint8_t *)(0x42704288UL))
#define bFM0P_MFS2_I2C_FCR_FCL1                   *((volatile  uint8_t *)(0x42704288UL))
#define bFM_MFS2_I2C_FCR_FCL2                     *((volatile  uint8_t *)(0x4270428CUL))
#define bFM0P_MFS2_I2C_FCR_FCL2                   *((volatile  uint8_t *)(0x4270428CUL))
#define bFM_MFS2_I2C_FCR_FSET                     *((volatile  uint8_t *)(0x42704290UL))
#define bFM0P_MFS2_I2C_FCR_FSET                   *((volatile  uint8_t *)(0x42704290UL))
#define bFM_MFS2_I2C_FCR_FLD                      *((volatile  uint8_t *)(0x42704294UL))
#define bFM0P_MFS2_I2C_FCR_FLD                    *((volatile  uint8_t *)(0x42704294UL))
#define bFM_MFS2_I2C_FCR_FLST                     *((volatile  uint8_t *)(0x42704298UL))
#define bFM0P_MFS2_I2C_FCR_FLST                   *((volatile  uint8_t *)(0x42704298UL))
#define bFM_MFS2_I2C_FCR_FSEL                     *((volatile  uint8_t *)(0x427042A0UL))
#define bFM0P_MFS2_I2C_FCR_FSEL                   *((volatile  uint8_t *)(0x427042A0UL))
#define bFM_MFS2_I2C_FCR_FTIE                     *((volatile  uint8_t *)(0x427042A4UL))
#define bFM0P_MFS2_I2C_FCR_FTIE                   *((volatile  uint8_t *)(0x427042A4UL))
#define bFM_MFS2_I2C_FCR_FDRQ                     *((volatile  uint8_t *)(0x427042A8UL))
#define bFM0P_MFS2_I2C_FCR_FDRQ                   *((volatile  uint8_t *)(0x427042A8UL))
#define bFM_MFS2_I2C_FCR_FRIIE                    *((volatile  uint8_t *)(0x427042ACUL))
#define bFM0P_MFS2_I2C_FCR_FRIIE                  *((volatile  uint8_t *)(0x427042ACUL))
#define bFM_MFS2_I2C_FCR_FLSTE                    *((volatile  uint8_t *)(0x427042B0UL))
#define bFM0P_MFS2_I2C_FCR_FLSTE                  *((volatile  uint8_t *)(0x427042B0UL))

#define bFM_MFS2_I2C_IBCR_INT                     *((volatile  uint8_t *)(0x42704020UL))
#define bFM0P_MFS2_I2C_IBCR_INT                   *((volatile  uint8_t *)(0x42704020UL))
#define bFM_MFS2_I2C_IBCR_BER                     *((volatile  uint8_t *)(0x42704024UL))
#define bFM0P_MFS2_I2C_IBCR_BER                   *((volatile  uint8_t *)(0x42704024UL))
#define bFM_MFS2_I2C_IBCR_INTE                    *((volatile  uint8_t *)(0x42704028UL))
#define bFM0P_MFS2_I2C_IBCR_INTE                  *((volatile  uint8_t *)(0x42704028UL))
#define bFM_MFS2_I2C_IBCR_CNDE                    *((volatile  uint8_t *)(0x4270402CUL))
#define bFM0P_MFS2_I2C_IBCR_CNDE                  *((volatile  uint8_t *)(0x4270402CUL))
#define bFM_MFS2_I2C_IBCR_WSEL                    *((volatile  uint8_t *)(0x42704030UL))
#define bFM0P_MFS2_I2C_IBCR_WSEL                  *((volatile  uint8_t *)(0x42704030UL))
#define bFM_MFS2_I2C_IBCR_ACKE                    *((volatile  uint8_t *)(0x42704034UL))
#define bFM0P_MFS2_I2C_IBCR_ACKE                  *((volatile  uint8_t *)(0x42704034UL))
#define bFM_MFS2_I2C_IBCR_ACT_SCC                 *((volatile  uint8_t *)(0x42704038UL))
#define bFM0P_MFS2_I2C_IBCR_ACT_SCC               *((volatile  uint8_t *)(0x42704038UL))
#define bFM_MFS2_I2C_IBCR_MSS                     *((volatile  uint8_t *)(0x4270403CUL))
#define bFM0P_MFS2_I2C_IBCR_MSS                   *((volatile  uint8_t *)(0x4270403CUL))

